{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.9", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 68]}}, {"name": "input_2", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_2", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 4]}}, {"name": "sequential_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "output_dim": 64, "input_dim": 22, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, null], "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": null, "name": "embedding_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.3}}]}, {"name": "sequential_3", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "output_dim": 64, "input_dim": 22, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 4], "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": 4, "name": "embedding_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.3}}]}, {"name": "dot_1", "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_3", 1, 0, {}]]], "class_name": "Dot", "config": {"name": "dot_1", "trainable": true, "axes": [2, 2], "normalize": false}}, {"name": "activation_1", "inbound_nodes": [[["dot_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}, {"name": "sequential_2", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "output_dim": 4, "input_dim": 22, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, null], "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": null, "name": "embedding_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.3}}]}, {"name": "add_1", "inbound_nodes": [[["activation_1", 0, 0, {}], ["sequential_2", 1, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "permute_1", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}}, {"name": "concatenate_1", "inbound_nodes": [[["permute_1", 0, 0, {}], ["sequential_3", 1, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"name": "lstm_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "return_state": false, "stateful": false, "trainable": true, "units": 32, "return_sequences": false, "implementation": 1, "use_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "activation": "tanh", "dropout": 0.0, "unroll": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "kernel_constraint": null}}, {"name": "dropout_4", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.3}}, {"name": "dense_1", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_1", "trainable": true, "bias_regularizer": null, "units": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"name": "activation_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "softmax"}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["activation_2", 0, 0]]}}